Revit 2027 API
FunctionId Properties
The FunctionId type exposes the following members.
Properties
Name | Description
File | The name of the file including the function throwing an exception.
Function | The name of the function throwing an exception.
Line | The line number of the function throwing an exception.
Top
See Also
Reference
FunctionId Class
Autodesk.Revit.Exceptions Namespace